Meta:

Scenario: Тест юлмарта

Given открыта главная страница
!-- Then проверить элементы главной страницы
!-- When нажать на кнопку спорт и туризм в меню на главной странице
!-- Then проверить элементы на странице навигации
!-- Then проверить совпадение заголовка с Спорт и Туризм на странице навигации
!-- When нажать на раздел зимний спорт навигации
!-- Then проверить элементы на странице навигации
!-- Then проверить совпадение заголовка с Зимний спорт на странице навигации
!-- When нажать на раздел горнолыжный спорт навигации
!-- Then проверить элементы на странице навигации
!-- Then проверить совпадение заголовка с Горные лыжи на странице навигации
!-- When нажать на последний элемент в списке товаров
!-- Then проверить элементы на странице одного товара
!-- Then проверить совпадение заголовка с Горные лыжи Fischer Hybrid 7.0 (12/13) на странице одного товара